Repository: vladimir-s/terms-descriptions
Catalog: lang/terms-descriptions-*.po
Languages: ru_ru

source: Enter the term, please
ru_ru: Введите термин, пожалуйста

source: Enter the link, please
ru_ru: Введите ссылку, пожалуйста

source: Content type is not set
ru_ru: Тип записи не указан

source: Term save error
ru_ru: Ошибка сохранения термина

source: The term was added
ru_ru: Термин был добавлен

source: Incorrect post ID
ru_ru: Некорректный ID записи

source: Link creation error
ru_ru: Ошибка создания ссылки

source: Post ID is not set
ru_ru: ID записи не указан

source: Unknown term ID
ru_ru: Не известный ID записи

source: Term delete error
ru_ru: Ошибка удаления термина

source: The term was deleted
ru_ru: Термин удалён

source: Unknown term
ru_ru: Не известный термин

source: Unknown terms IDs
ru_ru: Не известные ID терминов

source: Terms delete error
ru_ru: Ошибка удаления термина

source: The terms were deleted
ru_ru: Термины были удалены

source: Unknown terms
ru_ru: Не известные термины

source: Unknown term id
ru_ru: Не известный ID термина

source: Term update error
ru_ru: Ошибка обновления термина

source: The term was updated
ru_ru: Термин изменён

source: All
ru_ru: Все

source: Permalink update error
ru_ru: Ошибка обновления ссылки на термин

source: The term permalink was updated
ru_ru: Ссылка на термин изменена

source: Options
ru_ru: Настройки

source: Options saved
ru_ru: Настройки сохранены

source: Convert terms
ru_ru: Преобразовать термины

source: in posts of type
ru_ru: в постах типа

source: in comments
ru_ru: в комментариях

source: Convert terms in shortcodes
ru_ru: Преобразовывать термины в шорткодах (shortcodes)

source: Convert the first
ru_ru: Преобразовывать первые

source: occurrences of each term.
ru_ru: вхождений каждого термина.

source: Set "-1" if you want to convert all terms.
ru_ru: Установите "-1" если вы хотите преобразовать все термины.

source: Maximum transformations number
ru_ru: Максимальное количество преобразований

source: Set "-1" if you don't want to use this limitation.
ru_ru: Установите "-1" если вы не хотите использовать это ограничение.

source: Consider existing links
ru_ru: Учитывать существующие ссылки

source: If this option is checked plugin will count links that are added by hand.
ru_ru: Если эта опция установлена, плагин будет считать ссылки созданные вручную.

source: Add CSS class
ru_ru: Добавить CSS класс

source: to terms links.
ru_ru: к ссылкам на термины.

source: Add title attribute to links
ru_ru: Добавить title атрибут к ссылкам

source: Wrap link
ru_ru: "Обернуть" ссылку

source: text before
ru_ru: текст до

source: example: &lt;strong&gt;
ru_ru: пример: &lt;strong&gt;

source: text after
ru_ru: текст после

source: example: &lt;/strong&gt;
ru_ru: пример: &lt;/strong&gt;

source: Convert terms only on single pages
ru_ru: Преобразовывать термины только на страницах отдельных записей

source: Terms will not be converted on home, categories and archives pages.
ru_ru: Термины не будут преобразованы на главной, страницах категорий и архивов.

source: Convert terms in archive descriptions
ru_ru: Преобразовывать термины в шорткодах (shortcodes)

source: Terms will be converted convert in archive descriptions.
ru_ru: Термины не будут преобразованы на главной, страницах категорий и архивов.

source: Open link in a new tab
ru_ru: Открывать ссылку в новом табе

source: If this option is checked plugin will add target="_blank" to links.
ru_ru: Если эта опция установлена, плагин добавит target="_blank" к ссылкам.

source: Add nofollow to external links
ru_ru: Добавить nofollow для внешних ссылок

source: If this option is checked plugin will add rel="nofollow" to <strong>external</strong> links.
ru_ru: Если эта опция установлена, плагин добавит rel="nofollow" к <strong>внешним</strong> ссылкам.

source: Wrap external links with noindex tag
ru_ru: "Обернуть" внешнюю ссылку в тег noindex

source: If this option is checked plugin will wrap <strong>external</strong> links with &lt;noindex&gt; tag.
ru_ru: Если эта опция установлена, плагин "обернет" <strong>внешние</strong> ссылки в тег &lt;noindex&gt;.

source: Skip nofollow and noindex if link is internal
ru_ru: Игнорировать nofollow и noindex если ссылка внутренняя

source: If this option is checked plugin will check domain of <strong>external</strong> links. If it matches this site, the plugin will ignore "Add nofollow" and "Wrap with noindex" options.
ru_ru: Если эта опция установлена, плагин проверит домен <strong>внешней</strong> ссылки. Если он совпадает с доменом сайт, плагин проигнорирует опции "Добавить nofollow" и "Обернуть в noindex".

source: Skip tags
ru_ru: Пропустить теги

source: The plugin skips text inside tags like <code>a</code>, <code>h1..6</code>, <code>canvas</code>, <code>code</code>, etc. This option allows you to add additional tags to skip. Use regular expressions to specify tags and <code>|</code> (vertical line) to separate them.
ru_ru: Этот плагин пропускает текст внутри тегов вроде <code>a</code>, <code>h1..6</code>, <code>canvas</code>, <code>code</code> и т.п. Данная опция позволяет добавить дополнительные теги в этот список. Указывать теги нужно с помощью регулярных выражений, а разделять их символом вертикальной черты <code>|</code>.

source: <strong>Use this option with care</strong>. In most cases the default set of tags will be enough.
ru_ru: <strong>Используйте эту опцию осторожно</strong>. В большинстве случаев будет достаточно стандартного набора тегов.

source: Show
ru_ru: Показывать

source: terms on a page (in admin area)
ru_ru: терминов на странице (в админке)

source: Parser
ru_ru: Парсер

source: Simple parser
ru_ru: Простой парсер

source: Simple parser with quotes support
ru_ru: Простой парсер с поддержкой кавычек

source: Long terms first parser
ru_ru: Парсер с сортировкой терминов по их длинне

source: Orders terms by their lengths before searching them in text
ru_ru: Перед поиском терминов в тексте, сортирует их по убыванию их длин

source: Time step for permalink update, ms
ru_ru: Пауза между запросами на обновления постоянных ссылок, мс

source: This option allows adding pauses between permalinks updates to reduce server load. Value in milliseconds.
ru_ru: Эта опция определяет длительность паузы между запросами на обновление постоянных ссылок. Значение в миллисекундах.

source: Additional filters
ru_ru: Дополнительные фильтры

source: This option allows adding list of filters for which conversion will be applied. Each filter name should start from a new line. For example,<br> <pre><code>bbp_get_reply_content</code> <code>bbp_get_topic_content</code></pre> Please, pay attention that <code>the_content</code>, <code>comment_text</code> and <code>get_the_archive_description</code> filters are set by other options and will be ignored.
ru_ru: Эта опция позволяет добавить список фильтров для которых будут применяться преобразования ссылок. Имена фильтров должны начинаться с новой строки. Например,<br> <pre><code>bbp_get_reply_content</code> <code>bbp_get_topic_content</code></pre> Пожалуйста, обратите внимание, фильтры <code>the_content</code>, <code>comment_text</code> и <code>get_the_archive_description</code> устанавливаются с помощью других настроек и будут проигнорированы.

source: Update
ru_ru: Изменить

source: Terms Descriptions plugin is almost updated. Please, BACKUP YOUR DATABASE and press following button to
ru_ru: Плагин Terms Descriptions практически обновлен. Пожалуйста, СДЕЛАЙТЕ РЕЗЕРВНУЮ КОПИЮ БАЗЫ ДАННЫХ и нажмите следующую кнопку чтобы

source: Update DB
ru_ru: Обновить БД

source: Terms
ru_ru: Термины

source: Edit
ru_ru: Изменить

source: Delete
ru_ru: Удалить

source: Are you sure?
ru_ru: Вы уверены?

source: Add term
ru_ru: Добавить термин

source: Update term
ru_ru: Изменить термин

source: Cancel
ru_ru: Отмена

source: New term was added
ru_ru: Термин добавлен

source: Updating...
ru_ru: Обновляю...

source: Done!
ru_ru: Готово!

source: Select
ru_ru: Выбрать

source: Title. Double click to open the titles list or type some letters
ru_ru: Заголовок. Введите несколько букв или сделайте двойной клик

source: Title attribute text
ru_ru: Текст title атрибута ссылок

source: Post ID
ru_ru: ID записи

source: Term
ru_ru: Термин

source: Link
ru_ru: Ссылка

source: Link to
ru_ru: Ссылка на

source: External link
ru_ru: Внешняя ссылка

source: Use for selected post types
ru_ru: Использовать для постов следующих типов

source: Press this button if you have updated permalinks structure.
ru_ru: Нажмите эту кнопку если вы обновляли структуру постоянных ссылок.

source: Update permalinks
ru_ru: Обновить ссылки на термины

source: Remove selected
ru_ru: Удалить выбранные

source: Search
ru_ru: Поиск

source: Select All
ru_ru: Выбрать все

source: Term Link
ru_ru: Ссылка термина

source: Post Types
ru_ru: Типы постов

source: Premalinks updated
ru_ru: Ссылки обновлены

source: of
ru_ru: из

source: Import error
ru_ru: Ошибка импорта

source: Import successfully finished
ru_ru: Импорт успешно завершен

source: Terms creation error
ru_ru: Ошибка создания термина

source: Terms successfully created
ru_ru: Термин создан

source: Tools
ru_ru: Инструменты

source: Export / Import
ru_ru: Экспорт / Импорт

source: Export
ru_ru: Экспорт

source: Select file with terms
ru_ru: Выберите файл с терминами

source: Import
ru_ru: Импорт

source: Packet terms upload
ru_ru: Пакетная загрузка терминов

source: Terms list
ru_ru: Список терминов

source: Each term should be written on its own line. Use the following format.<br />word_form_1|word_form_2|...|post_id OR URL (with http://)|post_types (delimited with comma)<br />Examples:<br />apple|apples|21<br />pear|pears|http://site.domen|post,page,attachment<br />Note that if you use term_id the post with this id should exist.
ru_ru: Каждый термин должен быть записан в отдельной строке. Используйте следующий формат.<br />word_form_1|word_form_2|...|post_id OR URL (with http://)<br />Примеры:<br />яблоко|яблоки|21<br />груша|груши|http://site.domen<br />Обратите внимание, что если вы используете id терминов, то посты с этими id должны существовать.

source: Add terms
ru_ru: Добавить термины

source: CSV Export
ru_ru: CSV Экспорт

source: Get terms in CSV format
ru_ru: Загрузить термины в CSV формате

source: Please, note, you can't restore terms from this file. Use Export instead.
ru_ru: Пожалуйста, обратите внимание, вы не сможете восстановить термины из этого файла. Если необходимо последуещее восстановление, используйте Экспорт.

source: Disable Terms Descriptions plugin for this post
ru_ru: Отключить плагин Terms Descriptions для этой записи
